{"id":3,"date":"2021-11-03T20:05:42","date_gmt":"2021-11-03T20:05:42","guid":{"rendered":"https:\/\/bayviewholidayapartments.com\/?page_id=3"},"modified":"2022-03-14T21:09:25","modified_gmt":"2022-03-14T21:09:25","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n\n<section class=\"SimpleHeader\" id=\"SimpleHeader-block_622e49425ee72\">\n\n    <article class=\"SimpleHeader__inner\">\n                <h1 class=\"SimpleHeader__title white\">Privacy Policy<\/h6>\n                <\/article>\n<\/section>\n\n\n<section class='content-section' id=\"content-section-block_622e4cb2e7f9a\">\n\n    <div class=\"content-section\" style=\"width:80%;\">\n\n        <p class=\"p1\"><span class=\"s1\">Privacy Policy<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">INTRODUCTION<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Welcome to Bayview Holiday Apartments’ privacy policy.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Bayview Holiday Apartments respects your privacy and is committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">1. IMPORTANT INFORMATION AND WHO WE ARE<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Purpose of this privacy policy<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">This privacy policy aims to give you information on how Bayview Holiday Apartments collects and processes your personal data through your use of this website, including any data you may provide through this website when you make a booking enquiry or place a booking with us.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">It is important that you read this privacy policy or any other fair processing notice we may provide on specific occasions when we are collecting or processing personal data about you so that you are fully aware of how and why we are using your data. This privacy policy supplements any other notices, policies or terms and conditions we may have and is not intended to override them.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Controller<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Bayview Holiday Apartments is the controller and responsible for your personal data (collectively referred to as “we”, “us” or “our” in this privacy policy). <\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Data Privacy – Contact us<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">In addition, you may contact Dean Evans if you have any questions in relation to our data privacy practices or this privacy policy.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">If you have any questions about this privacy policy or our privacy practices, please contact our data privacy manager in the following ways:<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Name: Dean Evans<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Email address: Info@bayviewholidayapartments.com<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">You have the right to make a complaint at any time to the Information Commissioner’s Office (ICO), the UK supervisory authority for data privacy issues (www.ico.org.uk) if you feel we have not protected your data properly. We would, however, appreciate the chance to deal with your concerns before you approach the ICO so please contact us in the first instance.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Changes to the privacy policy and your duty to inform us of changes<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We will keep our privacy policy under regular review.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">It is important that the personal data we hold about you is accurate and current. Please keep us informed if your personal data changes during your relationship with us.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Third-party links<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Where this privacy notice is published on our website, please note that our website may include links to third-party websites, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites and are not responsible for their privacy statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">2. THE DATA WE COLLECT ABOUT YOU<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Personal data, or personal information, means any information about an individual from which that person can be identified. It does not include data where the identity has been removed (anonymous data).<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:<\/span><\/p>\r\n\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Identity Data<\/b> includes first name, last name, username or similar identifier, marital status, title, date of birth, occupation and gender.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Contact Data<\/b> includes billing address, delivery address, email address and telephone numbers.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Financial Data<\/b> includes bank account and payment card details.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Transaction Data<\/b> includes details about payments to and from you and other details of bookings you have made with us.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Technical Data<\/b> includes internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Experience &amp; Preferences Data <\/b>includes details of your experience in booking with us or staying at our properties, your interests, preferences, feedback and survey responses.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Usage Data<\/b> includes information about how you use our website and services.<\/span><\/li>\r\n \t<li class=\"li3\"><span class=\"s1\"><b>Marketing and Communications Data <\/b>includes your preferences in receiving marketing from us and our third parties and your communication preferences.<\/span><\/li>\r\n<\/ul>\r\n<p class=\"p3\"><span class=\"s1\">We may also collect, use and share <b>Anonymised or Aggregated Data<\/b> such as statistical or demographic data for any purpose. Anonymised or Aggregated Data could be derived from your personal data but is not considered personal data in law as this data will <b>not<\/b> directly or indirectly reveal your identity. For example, we may aggregate your Usage Data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect Anonymised or Aggregated Data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We do not collect any <b>Special Categories of Personal Data<\/b> about you (this includes details about your race or ethnicity, religious or philosophical beliefs, sex life, sexual orientation, political opinions, trade union membership, information about your health, and genetic and biometric data). Nor do we collect any information about criminal convictions and offences.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>If you fail to provide personal data<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Where we need to collect personal data by law, or under the terms of a contract we have with you, and you fail to provide that data when requested, we may not be able to perform the contract we have or are trying to enter into with you (for example, to provide you with goods or services). In this case, we may have to cancel a booking you have with us but we will notify you if this is the case at the time.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">3. HOW IS YOUR PERSONAL DATA COLLECTED?<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We use different methods to collect data from and about you including through:<\/span><\/p>\r\n\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Direct interactions.<\/b> You may give us your Identity, Contact and Financial Data by filling in forms or by corresponding with us by post, phone, email or otherwise. This includes personal data you provide when you:<\/span>\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\">make a booking enquiry;<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">place a booking;<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">cancel your booking;<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">request marketing to be sent to you; or<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">give us feedback or contact us.<\/span><\/li>\r\n<\/ul>\r\n<\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Interactions with the lead person in your party.<\/b> Your Identity and Contact details may be given to us by the lead person in your party (i.e. the person that placed the booking) as part of a list of the persons staying at our property.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Automated technologies or interactions.<\/b> As you interact with our website, we will automatically collect Technical Data about your equipment, browsing actions and patterns. We collect this personal data by using cookies and other similar technologies.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">Contact, Financial and Transaction Data may be collected from or shared with providers of technical, payment and delivery services.<\/span><\/li>\r\n<\/ul>\r\n<p class=\"p2\"><span class=\"s2\">4. HOW WE USE YOUR PERSONAL DATA <\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We will only use your personal data when the law allows us to. Most commonly, we will use your personal data in the following circumstances:<\/span><\/p>\r\n\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\">Where we need to perform the contract we are about to enter into or have entered into with you.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">Where it is necessary for our legitimate interests (or those of a third party) and your interests and fundamental rights do not override those interests.<\/span><\/li>\r\n \t<li class=\"li3\"><span class=\"s1\">Where we need to comply with a legal obligation.<\/span><\/li>\r\n<\/ul>\r\n<p class=\"p3\"><span class=\"s1\">Generally, we do not rely on consent as a legal basis for processing your personal data although we will get your consent before sending third party direct marketing communications to you via email or text message. You have the right to withdraw consent to marketing at any time by contacting us.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Purposes for which we will use your personal data<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We have set out below, in a table format, a description of the ways we plan to use your personal data, and which of the legal bases we rely on to do so. We have also identified what our legitimate interests are, where appropriate.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Note that we may process your personal data for more than one lawful ground depending on the specific purpose for which we are using your data. Please contact us if you need details about the specific legal ground we are relying on to process your personal data where more than one ground has been set out in the table below.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Please note that “legitimate interest” in the table below means the interest of our business in conducting and managing our business to enable us to give you the best service and the best and most secure experience. We make sure we consider and balance any potential impact on you (both positive and negative) and your rights before we process your personal data for our legitimate interests. We do not use your personal data for activities where our interests are overridden by the impact on you (unless we have your consent or are otherwise required or permitted to by law). You can obtain further information about how we assess our legitimate interests against any potential impact on you in respect of specific activities by contacting us.<\/span><\/p>\r\n\r\n<table class=\"t1\" cellspacing=\"0\" cellpadding=\"0\">\r\n<tbody>\r\n<tr>\r\n<td class=\"td1\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>Purpose\/Activity<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td2\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>Type of data<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td3\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>Lawful basis for processing including basis of legitimate interest<\/b><\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td1\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To register you as a new customer or guest<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td2\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact<\/span><\/p>\r\n<\/td>\r\n<td class=\"td3\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">Performance of a contract with you<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td4\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To process your booking or cancellation, which will include:(a) Managing payments, fees and charges(b) Collecting and recovering money owed to us(c) Returning money already paid to us in accordance with applicable terms and conditions governing cancellations<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td5\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact(c) Financial(d) Transaction<\/span><\/p>\r\n<\/td>\r\n<td class=\"td6\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Performance of a contract with you(b) Necessary for our legitimate interests (to enforce our rights, including recovering money due to us)<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td7\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To process your details as part of a party staying at any of our properties<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td8\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact<\/span><\/p>\r\n<\/td>\r\n<td class=\"td9\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">Necessary for our legitimate interests (to manage our properties and to protect our rights)<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td10\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To manage our relationship with you which will include:(a) Notifying you about changes to our terms or privacy policy(b) Asking you to leave a review, take a survey or provide us with feedback about our properties or our services<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td11\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact(c) Experience &amp; Preferences(d) Marketing and Communications<\/span><\/p>\r\n<\/td>\r\n<td class=\"td12\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Performance of a contract with you(b) Necessary to comply with a legal obligation(c) Necessary for our legitimate interests (to keep our records updated, to study how our guests use our services and\/or how people interact with our website, to improve our services and to develop and grow our business)<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td13\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To administer and protect our business and this website (including troubleshooting, data analysis, testing, system maintenance, support, reporting and hosting of data)<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td14\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact(c) Technical<\/span><\/p>\r\n<\/td>\r\n<td class=\"td15\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Necessary for our legitimate interests (for running our business, provision of administration and IT services, network security, to prevent fraud and in the context of a business reorganisation or group restructuring exercise)(b) Necessary to comply with a legal obligation<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td16\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To deliver relevant website content and advertisements to you and measure or understand the effectiveness of the advertising we serve to you<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td17\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact(c) Profile(d) Usage(e) Marketing and Communications(f) Technical<\/span><\/p>\r\n<\/td>\r\n<td class=\"td18\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">Necessary for our legitimate interests (to study how customers use our services, to develop them, to grow our business and to inform our marketing strategy)<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td19\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To use data analytics to improve our website, services, marketing, customer relationships and experiences<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td20\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Technical(b) Usage<\/span><\/p>\r\n<\/td>\r\n<td class=\"td21\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">Necessary for our legitimate interests (to define types of customers for our services, to keep our website updated and relevant, to develop our business and to inform our marketing strategy)<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<tr>\r\n<td class=\"td22\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\"><b>To make suggestions and recommendations to you about goods or services that may be of interest to you<\/b><\/span><\/p>\r\n<\/td>\r\n<td class=\"td23\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">(a) Identity(b) Contact(c) Technical(d) Usage(e) Experience &amp; Preferences(f) Marketing and Communications<\/span><\/p>\r\n<\/td>\r\n<td class=\"td24\" valign=\"middle\">\r\n<p class=\"p5\"><span class=\"s1\">Necessary for our legitimate interests (to develop our services and grow our business, and to provide the best service to our guests)<\/span><\/p>\r\n<\/td>\r\n<\/tr>\r\n<\/tbody>\r\n<\/table>\r\n<p class=\"p3\"><span class=\"s1\"><b>Marketing<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We strive to provide you with choices regarding certain personal data uses, particularly around marketing and advertising.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Promotional offers from us<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We may use your Identity, Contact, Technical, Usage and Profile Data to form a view on what services or products we think you may want or need, or what may be of interest to you. This is how we decide which services and offers may be relevant for you (we call this marketing).<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">You may receive marketing communications from us if you have requested information from us or made a booking with us and you have not opted out of receiving that marketing.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Third-party marketing<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We will get your express opt-in consent before we share your personal data with any third party for marketing purposes.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Opting out<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">You can ask us or third parties to stop sending you marketing messages at any time by following the opt-out links on any marketing messages sent to you or by contacting us at any time.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Where you opt out of receiving these marketing messages, this will not apply to personal data provided to us as a result of you making a booking with us.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Change of purpose<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purpose. If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Please note that we may process your personal data without your knowledge or consent, in compliance with the above rules, where this is required or permitted by law.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">5. DISCLOSURES OF YOUR PERSONAL DATA<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We may share your personal data with the parties set out below for the purposes set out in the table above.<\/span><\/p>\r\n\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\">Service providers acting as processors based within the UK and\/or the EEA who provide IT and system administration services or booking systems.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">Professional advisers acting as processors or controllers such as marketing consultants, insurers or lawyers. These professional advisers will usually be based in the UK and\/or the EEA.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">HM Revenue &amp; Customs, regulators and other authorities based in the United Kingdom who require reporting of processing activities in certain circumstances.<\/span><\/li>\r\n \t<li class=\"li3\"><span class=\"s1\">Third parties to whom we may choose to sell, transfer or merge parts of our business or our assets. Alternatively, we may seek to acquire other businesses or merge with them. If a change happens to our business, then the new owners may use your personal data in the same way as set out in this privacy policy.<span class=\"Apple-converted-space\"> <\/span><\/span><\/li>\r\n<\/ul>\r\n<p class=\"p3\"><span class=\"s1\">We require all third parties to respect the security of your personal data and to treat it in accordance with the law. We do not allow our third-party service providers to use your personal data for their own purposes and only permit them to process your personal data for specified purposes and in accordance with our instructions.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">6. INTERNATIONAL TRANSFERS<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">If we transfer your personal data out of the UK and\/or EEA, we ensure a similar degree of protection is afforded to it by ensuring at least one of the following safeguards is implemented:<\/span><\/p>\r\n\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\">We will only transfer your personal data to countries that have been deemed to provide an adequate level of protection for personal data by the European Commission or by the UK Information Commissioner.<\/span><\/li>\r\n \t<li class=\"li3\"><span class=\"s1\">Where we use certain service providers, we may use specific contracts approved by the European Commission or the UK Information Commissioner which give personal data the same protection it has in the UK or Europe.<\/span><\/li>\r\n<\/ul>\r\n<p class=\"p3\"><span class=\"s1\">Please contact us if you want further information on the specific mechanism used by us when transferring your personal data out of the EEA.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">7. DATA SECURITY<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We have put in place procedures to deal with any suspected personal data breach and will notify you and the UK Information Commissioner of a breach where we are legally required to do so.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">8. DATA RETENTION<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>How long will you use my personal data for?<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">To determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">By law we have to keep basic information about our customers (including Contact, Identity, Financial and Transaction Data) for six years after they cease being customers for legal and\/or tax purposes.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">In some circumstances you can ask us to delete your data: see section 9 of this policy below for further information.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">In some circumstances we will anonymise your personal data (so that it can no longer be associated with you) for research or statistical purposes, in which case we may use this information indefinitely without further notice to you.<\/span><\/p>\r\n<p class=\"p2\"><span class=\"s2\">9. YOUR LEGAL RIGHTS<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">Under certain circumstances, you have rights under data protection laws in relation to your personal data. You have the right to:<\/span><\/p>\r\n\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Request access<\/b> to your personal data (commonly known as a “data subject access request”). This enables you to receive a copy of the personal data we hold about you and to check that we are lawfully processing it.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Request correction<\/b> of the personal data that we hold about you. This enables you to have any incomplete or inaccurate data we hold about you corrected, though we may need to verify the accuracy of the new data you provide to us.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Request erasure<\/b> of your personal data. This enables you to ask us to delete or remove personal data where there is no good reason for us continuing to process it. You also have the right to ask us to delete or remove your personal data where you have successfully exercised your right to object to processing (see below), where we may have processed your information unlawfully or where we are required to erase your personal data to comply with local law. Note, however, that we may not always be able to comply with your request of erasure for specific legal reasons which will be notified to you, if applicable, at the time of your request.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Object to processing<\/b> of your personal data where we are relying on a legitimate interest (or those of a third party) and there is something about your particular situation which makes you want to object to processing on this ground as you feel it impacts on your fundamental rights and freedoms. You also have the right to object where we are processing your personal data for direct marketing purposes. In some cases, we may demonstrate that we have compelling legitimate grounds to process your information which override your rights and freedoms.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Request restriction of processing<\/b> of your personal data. This enables you to ask us to suspend the processing of your personal data in the following scenarios:<\/span>\r\n<ul class=\"ul1\">\r\n \t<li class=\"li4\"><span class=\"s1\">If you want us to establish the data’s accuracy.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">Where our use of the data is unlawful but you do not want us to erase it.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">Where you need us to hold the data even if we no longer require it as you need it to establish, exercise or defend legal claims.<\/span><\/li>\r\n \t<li class=\"li4\"><span class=\"s1\">You have objected to our use of your data but we need to verify whether we have overriding legitimate grounds to use it.<\/span><\/li>\r\n<\/ul>\r\n<\/li>\r\n \t<li class=\"li4\"><span class=\"s1\"><b>Request the transfer<\/b> of your personal data to you or to a third party. We will provide to you, or a third party you have chosen, your personal data in a structured, commonly used, machine-readable format. Note that this right only applies to automated information which you initially provided consent for us to use or where we used the information to perform a contract with you.<\/span><\/li>\r\n \t<li class=\"li3\"><span class=\"s1\"><b>Withdraw consent at any time<\/b> where we are relying on consent to process your personal data. However, this will not affect the lawfulness of any processing carried out before you withdraw your consent. If you withdraw your consent, we may not be able to provide certain services to you. We will advise you if this is the case at the time you withdraw your consent.<\/span><\/li>\r\n<\/ul>\r\n<p class=\"p3\"><span class=\"s1\">If you wish to exercise any of the rights set out above, please contact our data privacy manager.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>No fee usually required<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">You will not have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>What we may need from you<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We may need to request specific information from you to help us confirm your identity and ensure your right to access your personal data (or to exercise any of your other rights). This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Time limit to respond<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\">We try to respond to all legitimate requests within one month. Occasionally it could take us longer than a month if your request is particularly complex or you have made a number of requests. In this case, we will notify you and keep you updated.<\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>Bayview Holiday Apartments<\/b><\/span><\/p>\r\n<p class=\"p3\"><span class=\"s1\"><b>March 2022<\/b><\/span><\/p>\n    <\/div>\n\n<\/section>","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"inline_featured_image":false,"footnotes":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - Bayview Holiday Apartments<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - Bayview Holiday Apartments\" \/>\n<meta property=\"og:url\" content=\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"Bayview Holiday Apartments\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-14T21:09:25+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/\",\"url\":\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/\",\"name\":\"Privacy Policy - Bayview Holiday Apartments\",\"isPartOf\":{\"@id\":\"https:\/\/bayviewholidayapartments.com\/#website\"},\"datePublished\":\"2021-11-03T20:05:42+00:00\",\"dateModified\":\"2022-03-14T21:09:25+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/bayviewholidayapartments.com\/privacy-policy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/bayviewholidayapartments.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Privacy Policy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/bayviewholidayapartments.com\/#website\",\"url\":\"https:\/\/bayviewholidayapartments.com\/\",\"name\":\"Bayview Holiday Apartments\",\"description\":\"Luxury Family Staycations with Views of The English Rivera\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/bayviewholidayapartments.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Privacy Policy - Bayview Holiday Apartments","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/","og_locale":"en_US","og_type":"article","og_title":"Privacy Policy - Bayview Holiday Apartments","og_url":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/","og_site_name":"Bayview Holiday Apartments","article_modified_time":"2022-03-14T21:09:25+00:00","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/","url":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/","name":"Privacy Policy - Bayview Holiday Apartments","isPartOf":{"@id":"https:\/\/bayviewholidayapartments.com\/#website"},"datePublished":"2021-11-03T20:05:42+00:00","dateModified":"2022-03-14T21:09:25+00:00","breadcrumb":{"@id":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/bayviewholidayapartments.com\/privacy-policy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/bayviewholidayapartments.com\/privacy-policy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/bayviewholidayapartments.com\/"},{"@type":"ListItem","position":2,"name":"Privacy Policy"}]},{"@type":"WebSite","@id":"https:\/\/bayviewholidayapartments.com\/#website","url":"https:\/\/bayviewholidayapartments.com\/","name":"Bayview Holiday Apartments","description":"Luxury Family Staycations with Views of The English Rivera","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/bayviewholidayapartments.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":8,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"predecessor-version":[{"id":568,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages\/3\/revisions\/568"}],"wp:attachment":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}