{"id":577,"date":"2022-03-14T21:23:19","date_gmt":"2022-03-14T21:23:19","guid":{"rendered":"https:\/\/bayviewholidayapartments.com\/?page_id=577"},"modified":"2022-03-15T19:02:30","modified_gmt":"2022-03-15T19:02:30","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/bayviewholidayapartments.com\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"\n\n<section class=\"SimpleHeader\" id=\"SimpleHeader-block_622e49425ee72\">\n\n    <article class=\"SimpleHeader__inner\">\n                <h1 class=\"SimpleHeader__title white\">Terms &#038; Conditions<\/h6>\n                <\/article>\n<\/section>\n\n\n<section class='content-section' id=\"content-section-block_622fb0e6cd3d4\">\n\n    <div class=\"content-section\" style=\"width:80%;\">\n\n        <h4>The Contract<\/h4>\r\n<p>The contract for a short-term holiday rental will be between Bayview Holiday Apartments (referred to as “us”, “we” or “our”) and the person making the booking and all members of the holiday party (referred to as “you” or “your”) in the following booking terms and conditions. As our properties are located in England, you and we agree that the laws of England will govern our contract with you (the “contract”). If any individual term or clause stated in these terms and conditions held to be invalid, impermissible or unenforceable permissible by law, the remaining terms shall be unaffected and shall remain valid.\r\nThe contract will not come into force until we have received the deposit referred to in clause 2 below. The contract will be subject to these booking terms and conditions, and must be complied with. The party leader must be at least 18 years of age at the time of booking and prior to arrival we must have full contact details of the party leader.<\/p>\r\n<h4>2. Deposit and Payment<\/h4>\r\n<p>Your booking (“booking”) may be placed over the telephone, by email or directly on our online reservation system. Where your booking is communicated to us by telephone or by email, we will enter it onto our online reservation system, which will automatically generate a summary by email to the email address you provide in the online booking form. However, that does not mean that your booking is yet confirmed or that a contract is yet in force between us and you.<\/p>\r\n<p>Your booking will only be confirmed and our contract will only come into force once we have received payment in cleared funds of a deposit of thirty (30%) of the full cost of your booking (the “deposit”).<\/p>\r\n<p>The deposit must be paid within 24 hours (1) days of the booking being placed.\r\nThe balance of the rental will be due for payment 8 weeks prior to your holiday commencement date (the “holiday commencement date”).<\/p>\r\n<p>If you paid the deposit by credit or debit card, you authorise us to use the details of the same credit or debit card to settle the balance of the rental. we will only act on this authority if you have not contacted us prior to the balance due date to arrange alternative payment of the balance.<\/p>\r\n<p>If for any reason we are unable to take payment of the balance by the due date and you are unable to promptly rearrange payment (or we cannot get hold of you to arrange for payment to be made) we will be entitled to treat that as your intention to cancel the booking. If your booking is made less than 8 weeks prior to the holiday commencement date then your booking will only be confirmed and our contract will only come into force once we have received payment in full for the booking in cleared funds.<\/p>\r\n<p>No entry to our properties will be allowed without payment, in full, being cleared beforehand.<\/p>\r\n<p>We accept payment by most major credit or debit cards and by bank transfer.<\/p>\r\n<h4>3. Cancellation<\/h4>\r\n<p>Cancellations must be notified to and received by us in writing (preferably by email) and once received we will confirm and process your cancellation request.<\/p>\r\n<p>We strongly advise that you have appropriate holiday cancellation cover in place at the time of booking.<\/p>\r\n<p>Cancellations must be made in writing to us by emailing info@bayviewholidayapartments.com. We will confirm your cancellation in writing by emailing you.\r\nIf you cancel a booking more than 8 weeks before arrival the deposit made at the time of placing the booking will not be refunded to you. any additional deposit or accommodation related payment will be refunded to you.<\/p>\r\n<p>If you cancel a booking for accommodation less than 8 weeks prior to the start date of the holiday you will not be entitled to a refund and we furthermore reserve the right to invoice you for an amount up to 100% of the cost of the holiday if the balance has not been paid.<\/p>\r\n<h4>4. Cancellation by us for reasons beyond our control (“force majeure”)<\/h4>\r\n<p>We won’t be deemed to be in breach of this contract, or otherwise liable to you, by reason of any delay in performance or non-performance of any of our obligations in this contract to the extent that such delay or non-performance is caused by circumstances beyond our reasonable control (for example if access to and use of our property is prevented by fire, flood, exceptional weather conditions, epidemics, pandemics, destruction\/damage, internet or other communications failure, blocked roads, war\/terrorism, nuclear\/radioactive disaster affecting us or our property) (these are sometimes referred to as “force majeure events”).<\/p>\r\n<p>If for any reason beyond our control we are forced to cancel your booking (or bring it to an end early) due to a force majeure event affecting us or our property we will refund you the full amount of your remaining lodging costs based on the time of your booking remaining. This will be the full extent of our liability and no additional compensation, expenses or costs (such as travel or replacement lodging costs) will be payable.<\/p>\r\n<h4>5. Period and other terms of hire<\/h4>\r\n<p>The period from the holiday commencement date to the day of departure set out in the booking (the “holiday departure date”) is the “holiday period”.<\/p>\r\n<p>Unless expressly agreed by us in writing, you should not arrive before 3 pm on the holiday commencement date, and you must leave and vacate the property by 10 am on the holiday departure date. failure to do so may result in you being charged a further day’s rental.\r\nYou must not use the property except for the purpose of a holiday during the holiday period, and not for any other purpose or for a longer period except with our express written agreement.<\/p>\r\n<p>The contract to stay in the property for the holiday period, does not create the relationship of landlord and tenant between the parties.<\/p>\r\n<p>This contract relates to a “holiday let” the purpose of which is to confer on you as a holidaymaker the right to occupy our property for a holiday only. you shall not be entitled to any private residential tenancy or other tenancy, assured short hold or assured tenancy, lease, licence or other right to occupy, nor shall you obtain any security of tenure under any applicable law including but not limited to under the private housing (tenancies) (England) act 2016 now or at the end of the holiday period. you may not sub-let the property.<\/p>\r\n<p>In the event that you are required, in accordance with guidelines imposed by the UK and Scottish governments in relation to the disease known as coronavirus disease (covid-19) and the virus known as severe acute respiratory syndrome coronavirus 2 (sars-cov-2)), to self-isolate at the property you will be responsible for the cost of (i) any additional nights out with the holiday period and (ii) rehousing any booked guests that are displaced as a result of the additional nights required by you in an equivalent property.<\/p>\r\n<h4>6. Number of persons using the property<\/h4>\r\n<p>Under no circumstances may more than the maximum number of persons stated on our website occupy the property, except with our express written permission in which case we shall be entitled to charge an additional fee. We reserve the right to refuse admittance or require you to leave our property if this condition is not observed. Any persons other than members of your party must not use our accommodation or facilities.<\/p>\r\n<h4>7. Our liability<\/h4>\r\n<p>We, our employees, contractors, cleaners and other representatives shall not be liable to you or your party for loss or damage to property howsoever arising. you must take all necessary steps to safeguard yourselves and your property. Nothing in this clause shall exclude or limit any liability that we are unable to limit or exclude by applicable law, such as liability for death or personal injury caused by our negligence.<\/p>\r\n<h4>8. Care of the property<\/h4>\r\n<p>You are responsible for the property and are expected to take all reasonable care of its furniture, pictures, fittings and effects, in or on the property. You must leave them in the same state of repair, and in a reasonable clean and tidy condition at the end of the rental period. You must not use the properties for any dangerous, offensive, noxious, noisy, illegal or immoral activities or carry on there any act that may be a nuisance or annoyance to the owner or other neighbouring properties.<\/p>\r\n<p>Smoking is not allowed in any of our properties.<\/p>\r\n<p>You must ensure the property is securely locked when not occupied by you.<\/p>\r\n<h4>9. Damages &amp; Breakages<\/h4>\r\n<p>You are legally bound to reimburse us for replacement, repair or extra cleaning costs on demand. Any damages or breakages will have to be paid for in full on demand within seven (7) days of notification in writing (although we would not charge you for the odd glass or plate). We recommend that you have appropriate insurance in place to cover this. If you lose a key, we will replace it upon you paying for the cutting of a new one.<\/p>\r\n<h4>10. Wi-Fi &amp; Internet<\/h4>\r\n<p>Free wi-fi and broadband internet is provided for your reasonable use and may be subject to separate terms and conditions. You agree to reasonable and lawful usage of this service. We will not be liable for slow connections or for any interruptions to or the failure of this service.<\/p>\r\n<h4>11. Right of entry<\/h4>\r\n<p>We shall be allowed the right of entry to the property at all reasonable times for purposes of inspection or to carry out any necessary repairs or maintenance.<\/p>\r\n\r\n<h4>12. Complaints<\/h4>\r\n<p>Every effort has been made to ensure that you have an enjoyable stay. however, if you have any problem or cause for complaint, it is essential that you contact us immediately to give us the chance to resolve it. We value your custom and want you to return (and to recommend us to your friends!). We live nearby, and will do our best to resolve any problem.<\/p>\r\n<h4>13. Data privacy statement<\/h4>\r\n<p>See our privacy policy here www.bayviewholidayapartments.com\/privacy-policy<\/p>\r\n<h4>14. Pets<\/h4>\r\n<p>Pets are not permitted at any of our Bayview holiday apartments.<\/p>\r\n<h4>15. Care of your property<\/h4>\r\nYour vehicles and their accessories and contents, and any property and valuables you bring with you are left entirely at your own risk.\r\nIf you leave any property behind, we will use reasonable endeavours to return it to you, although we reserve the right to charge you in advance for any reasonable postal or courier costs. we may dispose of any unclaimed property after six (6) months.\n    <\/div>\n\n<\/section>","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"inline_featured_image":false,"footnotes":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms &amp; Conditions - Bayview Holiday Apartments<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms &amp; Conditions - Bayview Holiday Apartments\" \/>\n<meta property=\"og:url\" content=\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Bayview Holiday Apartments\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-15T19:02:30+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/\",\"url\":\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/\",\"name\":\"Terms & Conditions - Bayview Holiday Apartments\",\"isPartOf\":{\"@id\":\"https:\/\/bayviewholidayapartments.com\/#website\"},\"datePublished\":\"2022-03-14T21:23:19+00:00\",\"dateModified\":\"2022-03-15T19:02:30+00:00\",\"breadcrumb\":{\"@id\":\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"http:\/\/bayviewholidayapartments.com\/terms-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/bayviewholidayapartments.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms &#038; Conditions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/bayviewholidayapartments.com\/#website\",\"url\":\"https:\/\/bayviewholidayapartments.com\/\",\"name\":\"Bayview Holiday Apartments\",\"description\":\"Luxury Family Staycations with Views of The English Rivera\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/bayviewholidayapartments.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms & Conditions - Bayview Holiday Apartments","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"http:\/\/bayviewholidayapartments.com\/terms-conditions\/","og_locale":"en_US","og_type":"article","og_title":"Terms & Conditions - Bayview Holiday Apartments","og_url":"http:\/\/bayviewholidayapartments.com\/terms-conditions\/","og_site_name":"Bayview Holiday Apartments","article_modified_time":"2022-03-15T19:02:30+00:00","twitter_card":"summary_large_image","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"http:\/\/bayviewholidayapartments.com\/terms-conditions\/","url":"http:\/\/bayviewholidayapartments.com\/terms-conditions\/","name":"Terms & Conditions - Bayview Holiday Apartments","isPartOf":{"@id":"https:\/\/bayviewholidayapartments.com\/#website"},"datePublished":"2022-03-14T21:23:19+00:00","dateModified":"2022-03-15T19:02:30+00:00","breadcrumb":{"@id":"http:\/\/bayviewholidayapartments.com\/terms-conditions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["http:\/\/bayviewholidayapartments.com\/terms-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"http:\/\/bayviewholidayapartments.com\/terms-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/bayviewholidayapartments.com\/"},{"@type":"ListItem","position":2,"name":"Terms &#038; Conditions"}]},{"@type":"WebSite","@id":"https:\/\/bayviewholidayapartments.com\/#website","url":"https:\/\/bayviewholidayapartments.com\/","name":"Bayview Holiday Apartments","description":"Luxury Family Staycations with Views of The English Rivera","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/bayviewholidayapartments.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"acf":[],"_links":{"self":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages\/577"}],"collection":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/comments?post=577"}],"version-history":[{"count":8,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages\/577\/revisions"}],"predecessor-version":[{"id":593,"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/pages\/577\/revisions\/593"}],"wp:attachment":[{"href":"https:\/\/bayviewholidayapartments.com\/wp-json\/wp\/v2\/media?parent=577"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}